app/views/shared/_header_nav.haml

SELECT `scores`.* FROM `scores` LIMIT 1
---
        .nav.pull-right
          %li=link_to Score.first.right, quiz_path(1), :id => 'header-score'