app/controllers/posts_controller.rb

SELECT `tags`.* FROM `tags`
---
  def index
    @tags = Tag.all

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def show
    @post = Post.find params[:id]

INSERT INTO `posts` (`content`, `created_at`, `published_date`, `title`, `type`, `updated_at`) VALUES ('Event Post 1 Content', '2012-09-23 15:39:54', '2012-09-23', 'Event Post 1', 'EventPost', '2012-09-23 15:39:54')
---
  def create
    @post = params[:post_type].constantize.new params[:post]

    if @post.save