app/controllers/quizzes_controller.rb

  def show
    @score = Score.first
---
SELECT `scores`.* FROM `scores` LIMIT 1