app/controllers/words_controller.rb

  def index
    @words = Word.page(params[:page])
---
SELECT COUNT(*) FROM `words`
SELECT `words`.* FROM `words` LIMIT 10 OFFSET 0

  def show
    @word = Word.find params[:id]
---
SELECT `words`.* FROM `words` WHERE `words`.`id` = 1 LIMIT 1

  def create
    @word = Word.new params[:word]

    if @word.save
---
INSERT INTO `words` (`created_at`, `example`, `example_translation`, `term`, `translation`, `updated_at`) VALUES ('2012-09-24 10:46:48', '나는 이름이 비야입니다.', 'My name is Bia.', '이름', 'Name', '2012-09-24 10:46:48')

  def edit
    @word = Word.find params[:id]
---
SELECT `words`.* FROM `words` WHERE `words`.`id` = 1 LIMIT 1

  def update
    @word = Word.find params[:id]

    if @word.update_attributes params[:word]
---
SELECT `words`.* FROM `words` WHERE `words`.`id` = 1 LIMIT 1
UPDATE `words` SET `term` = '날씨', `translation` = 'weather', `example` = '오늘 날씨가 좋은 것입니다.', `example_translation` = 'The weather today is nice.', `updated_at` = '2012-10-07 14:37:40' WHERE `words`.`id` = 2